[
    {
        "period": "2020",
        "theme": "From social impact to projects that spark joy",
        "projects": [
            {
                "name": "KeyPaws",
                "url": "https://www.keypa.ws",
                "blurb": "KeyPaws is my side project that uses AI to protect your computer from cats on your keyboard."
            },
            {
                "name": "Mindfulpuss",
                "url": "https://www.mindfulpuss.com",
                "blurb": "Mindfulpuss is my podcast that encourages you to live life in the meow."
            },
            {
                "name": "Ask EveryDoctor",
                "url": "https://ask.everydoctor.org.uk/",
                "blurb": "At the height of the pandemic I developed a survey tool for campaigning organisation EveryDoctor to track PPE in the NHS."
            },
            {
                "name": "Pembroke House",
                "url": "https://www.pembrokehouse.org.uk",
                "blurb": "Working with designer Rosalba Ellis again, I built a fully customisable website for Pembroke House, a centre for social action and residential community in Walworth."
            },
            {
                "name": "JAMstack Starter",
                "url": "https://jamstack-blaster.netlify.app/",
                "blurb": "All web projects share the same foundations. JAMstack Starter condenses my sixteen years of experience building accessible and privacy-friendly websites and apps into an open source starter template to robustly jumpstart new projects."
            },
            {
                "name": "Gwen Hustwit",
                "url": "https://www.gwenhustwit.com",
                "blurb": "Made possible by JAMstack Starter, Gwen's affordable, accessible website —fully editable and customisable via a CMS—was put together in a single day of collaboration in Crystal Palace."
            }
        ]
    },
    {
        "period": "2019",
        "theme": "Lecturing and a return to political tech",
        "projects": [
            {
                "name": "Compass",
                "url": "https://www.compassonline.org.uk",
                "blurb": "Collaborating with designer Rosalba Ellis I developed a new website for the centre-left thinktank Compass."
            },
            {
                "name": "Democracy Club's Election Widget",
                "url": "https://democracyclub.org.uk/projects/election-widget/",
                "blurb": "Working in a distributed team well before it was trendy, I collaborated with the team at Democracy Club to develop a fully unit-tested, accessible polling station finder and election information widget in time for the 2019 election."
            },
            {
                "name": "Can I Vote?",
                "url":"https://www.canivote.org.uk",
                "blurb": "Another project for the 2019 election, Can I Vote highlighted to Commonwealth citizens that they are eligible to vote in UK elections."
            }
        ]
    }
]